## Big Countries Leetcode Task1

In [ ]:
import pandas as pd
import numpy as np

In [22]:
data = [['Afghanistan', 'Asia', 652230, 25500100, 20343000000], ['Albania', 'Europe', 28748, 2831741, 12960000000], ['Algeria', 'Africa', 2381741, 37100000, 188681000000], ['Andorra', 'Europe', 468, 78115, 3712000000], ['Angola', 'Africa', 1246700, 20609294, 100990000000]]
World = pd.DataFrame(data, columns=['name', 'continent', 'area', 'population', 'gdp']).astype({'name':'object', 'continent':'object', 'area':'Int64', 'population':'Int64', 'gdp':'Int64'})

In [23]:
World

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [24]:
World['area']

0     652230
1      28748
2    2381741
3        468
4    1246700
Name: area, dtype: Int64

In [25]:
World['area']>=3000000

0    False
1    False
2    False
3    False
4    False
Name: area, dtype: boolean

In [27]:
World['population']>=25000000

0     True
1    False
2     True
3    False
4    False
Name: population, dtype: boolean

In [30]:
World=World[(World['area']>=3000000) | (World['population']>=25000000)]
World

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
2      Algeria    Africa  2381741    37100000  188681000000

In [33]:
World=World[['name','population','area']]
World

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741